In [1]:
import pandas as pd

# 合并数据集

## 数据库风格的DataFrame合并

In [2]:
df1 = pd.DataFrame({'key':list('bbacaab'),'data1':range(7)})

df2 = pd.DataFrame({'key':list('abd'),'data2':range(3)})

In [3]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [4]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [5]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [6]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [1]:
import pandas as pd

In [3]:
df3 = pd.DataFrame({'lkey':list('bbacaab'),'data1':range(7)})

df4 = pd.DataFrame({'rkey':list('abd'),'data2':range(3)})

In [4]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [5]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [6]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [7]:
df1 = pd.DataFrame({'key':list('bac'),'data1':range(1,4)})

df2 = pd.DataFrame({'key':list('bad'),'data2':range(5,8)})

In [8]:
df1

  key  data1
0   b      1
1   a      2
2   c      3

In [9]:
df2

  key  data2
0   b      5
1   a      6
2   d      7

In [10]:
pd.merge(df1,df2,on='key',how='left')  #左连接

  key  data1  data2
0   b      1    5.0
1   a      2    6.0
2   c      3    NaN

In [11]:
pd.merge(df1,df2,on='key')  #内连接

  key  data1  data2
0   b      1      5
1   a      2      6

In [12]:
pd.merge(df1,df2,on='key',how='outer')  #外连接

  key  data1  data2
0   b    1.0    5.0
1   a    2.0    6.0
2   c    3.0    NaN
3   d    NaN    7.0

In [13]:
pd.merge(df1,df2,on='key',how='right')  #右连接

  key  data1  data2
0   b    1.0      5
1   a    2.0      6
2   d    NaN      7

## 索引上的合并

In [14]:
left1 = pd.DataFrame({'key':list('abaabc'),'value':range(6)})

right1 = pd.DataFrame({'group_val':[3.7,5]},index=['a','b'])

In [15]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [16]:
right1

   group_val
a        3.7
b        5.0

In [17]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.7
2   a      2        3.7
3   a      3        3.7
1   b      1        5.0
4   b      4        5.0

## 轴向连接

In [18]:
import numpy as np

In [19]:
arr = np.arange(12).reshape((3,4))

arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [21]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [22]:
s1 = pd.Series([0,1],index=['a','b'])

s2 = pd.Series([2,3,4],index=list('cde'))

s3 = pd.Series([5,6],index=list('fg'))

pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [23]:
df1 = pd.DataFrame(np.random.randn(3,4),columns=list('abcd'))

df2 = pd.DataFrame(np.random.randn(2,3),columns=list('bda'))

In [24]:
df1

          a         b         c         d
0 -0.521084  0.415770 -0.342887  2.010475
1  1.146040  0.479314 -0.750582 -0.012981
2  2.236922 -0.045034  0.152586 -0.736452

In [25]:
df2

          b         d         a
0  1.660288 -0.010343  0.678890
1 -0.949442 -0.565197 -1.403339

In [26]:
pd.concat([df1,df2])

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.521084  0.415770 -0.342887  2.010475
1  1.146040  0.479314 -0.750582 -0.012981
2  2.236922 -0.045034  0.152586 -0.736452
0  0.678890  1.660288       NaN -0.010343
1 -1.403339 -0.949442       NaN -0.565197

In [28]:
pd.concat([df1,df2],axis=1)

          a         b         c         d         b         d         a
0 -0.521084  0.415770 -0.342887  2.010475  1.660288 -0.010343  0.678890
1  1.146040  0.479314 -0.750582 -0.012981 -0.949442 -0.565197 -1.403339
2  2.236922 -0.045034  0.152586 -0.736452       NaN       NaN       NaN

In [30]:
pd.concat([df1,df2],keys=['df1','df2'])

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

              a         b         c         d
df1 0 -0.521084  0.415770 -0.342887  2.010475
    1  1.146040  0.479314 -0.750582 -0.012981
    2  2.236922 -0.045034  0.152586 -0.736452
df2 0  0.678890  1.660288       NaN -0.010343
    1 -1.403339 -0.949442       NaN -0.565197

In [31]:
pd.concat([df1,df2],ignore_index=True)

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.521084  0.415770 -0.342887  2.010475
1  1.146040  0.479314 -0.750582 -0.012981
2  2.236922 -0.045034  0.152586 -0.736452
3  0.678890  1.660288       NaN -0.010343
4 -1.403339 -0.949442       NaN -0.565197

## 合并重叠数据

In [33]:
a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=list('fedcba'))

b = pd.Series(np.arange(len(a)),index=list('fedcba'))

In [34]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [35]:
b

f    0
e    1
d    2
c    3
b    4
a    5
dtype: int32

In [37]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

## 移除重复数据

In [39]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})

data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [42]:
data['k3'] = range(7)

In [43]:
data

    k1  k2  k3
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  k3
0  one   1   0
3  two   3   3

In [45]:
data.drop_duplicates(['k1','k2'])

    k1  k2  k3
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

## 替换值

In [46]:
data = pd.Series([1,-999,2,-999,-1000,3])

data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [47]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64